Terraform Plan for terraform/eus/dev/frontend:

```
data.azurerm_container_app_environment.aca_env: Reading...
data.azurerm_container_app_environment.aca_env: Read complete after 1s [id=/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.App/managedEnvironments/opre-ops-dev-eus-core-cae]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.frontend will be created
  + resource "azurerm_container_app" "frontend" {
      + container_app_environment_id  = "/subscriptions/91ab8ed2-74e6-4366-aaf5-036186ec70db/resourceGroups/opre-ops-dev-eus-core-rg/providers/Microsoft.App/managedEnvironments/opre-ops-dev-eus-core-cae"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "opre-ops-dev-eus-fe-ca"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "opre-ops-dev-eus-core-rg"
      + revision_mode                 = "Multiple"

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 80
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 1
          + revision_suffix = "a455ff5c"

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "ghcr.io/hhs/opre-ops/ops-frontend:a455ff5c590de971a90f930556b36a154091c551"
              + memory            = "0.5Gi"
              + name              = "ops-frontend"

              + env {
                  + name  = "REACT_APP_BACKEND_DOMAIN"
                  + value = "https://opre-ops-dev-eus-be-ca.blackpond-5cf544be.eastus.azurecontainerapps.io"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

Plan saved to GH artifacts.